Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series

In [1]:
# import pandas as pd
import pandas as pd
# simple list
data = [4,8,15,16,23,42]
# providing an index
ser = pd.Series(data, index=[0, 1, 2, 3,4,5])
print(ser)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the 
variable print it.

In [5]:
import pandas as pd
li=[10,20,30,40,50,60,70,80,90,100]
s=pd.Series(li)
print(s)

0     10
1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:
Then, print the DataFrame

In [6]:
import pandas as pd
df=pd.read_csv("data.csv")
print(df)

    Name   Age    Gender
0  Alice     25  Female
1    Bob     30     Male
2  Claire    27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Solution: Dataframe contains data in tabular format with rows and columns whereas series contains data in the form of list or array. We can read any type of file such as csv,excel,html,txt using pandas dataframe unlike series.

Q5.What are some common functions you can use to manipulate data in a Pandas DataFrame? Can 
you give an example of when you might use one of these functions?

In [7]:
df.head()

    Name   Age    Gender
0  Alice     25  Female
1    Bob     30     Male
2  Claire    27  Female

head function of pandas is used to return first 5 records present inside dataframe

In [8]:
df.tail()

    Name   Age    Gender
0  Alice     25  Female
1    Bob     30     Male
2  Claire    27  Female

tail function of pandas is used to return last 5 records present inside dataframe

In [9]:
df.columns

Index(['Name ', 'Age ', 'Gender'], dtype='object')

It is used to return number of columns present in the dataset

In [10]:
df.describe()

            Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

If any numerical feature is present in the dataframe then describe function will give mean,average,standard deviation and other central tendancy measures

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In panel, data and size are mutable unlike dataframe and series

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [ ]:
import pandas as pd
# Create pandas Serie
emp_id = pd.Series([1,2,3])
emp_name = pd.Series(["mia","kia","siya"])
salary  = pd.Series([10000,23000,22000])
df=pd.concat([emp_id,emp_name,salary],axis=1)
print(df)